{
  "navbar": {
    "home": "01. Accueil",
    "projects": "02. Projets",
    "about": "03. À propos",
    "contact": "04. Contact"
  },
  "home": {
    "description": "Développeur web autodidacte",
    "welcome": "Bienvenue sur mon site personnel !",
    "welcome-description": "Sur ce site, vous trouverez une sélection de mes projets de développement web les plus remarquables, des informations sur moi-même et des détails sur la manière de me contacter.",
    "button": "Voyons ça !"
  },
  "projects": {
    "title": "Projets",
    "heading": "Mes projets",
    "blog": {
      "title": "Blog API",
      "details": "Une application blog full-stack construite avec Next JS pour le front-end et Express JS pour le back-end.",
      "list": [
        "Création d'une <strong>API REST</strong> en tant que back-end en utilisant Express JS.",
        "Implémentation de <strong>MongoDB</strong> en tant que base de données."
      ]
    },
    "shopping": {
      "title": "Panier d'achat",
      "details": "Une application front-end e-commerce construite avec React et Next JS.",
      "list": [
        "Utilisation de <strong>Next.js</strong> pour le routage et l'optimisation d'images et de polices.",
        "Implémentation de <strong>React context</strong> pour éviter prop drilling."
      ]
    },
    "memory": {
      "title": "Jeu de mémoire",
      "details": "Une application front-end sur un jeu de mémoire développée avec React.",
      "list": [
        "Apprentissage de l'utilisation de <strong>React hooks</strong> et de méthodes de <strong>lifecycle</strong>.",
        "Implémentation de <strong>Zustand</strong> pour la gestion d'état."
      ]
    },
    "portfolio": {
      "title": "Portefeuille",
      "details": "Une application front-end de mon portefeuille personnel, construite avec Astro.",
      "list": [
        "Utilisation de <strong>Astro</strong> pour le routage et la minimisation de l'expédition de JS inutilisé.",
        "Utilisation de <strong>Typescript</strong> pour la vérification de type."
      ]
    }
  },
  "about": {
    "title": "À propos",
    "content": "Salut ! Je m'appelle Fábio Rodrigues. Je suis un développeur autodidacte de 25 ans avec une passion pour l'apprentissage continu et l'élargissement de mes compétences. J'apprends le développement web depuis mai 2022 et j'utilise le programme \"The Odin Project\" comme guide pour mes études.\r\n\r\nJe suis très intéressé par la technologie et la façon dont elle peut être utilisée pour résoudre des problèmes et améliorer la vie des gens. Pendant la pandémie de COVID-19, j'ai décidé de saisir l'occasion de poursuivre ma passion pour le développement web et j'ai depuis acquis des compétences en HTML, CSS et JavaScript.\r\n\r\nEn plus de mes études, j'aime rester actif grâce à des activités telles que la randonnée et passer du temps avec mes amis et ma famille. Pendant mon temps libre, je suis un lecteur passionné et j'aime jouer aux jeux vidéo.\r\n\r\nJe suis toujours à la recherche de nouvelles opportunités pour appliquer mes compétences et évoluer en tant que développeur. Je vous remercie de me considérer pour des opportunités et des défis potentiels."
  },
  "contact": {
    "title": "Contact",
    "email": {
      "heading": "E-mail",
      "description": "Contactez-moi par e-mail.",
      "button": "Envoyer un e-mail",
      "link": "mailto:sousa892@hotmail.com"
    },
    "github": {
      "heading": "GitHub",
      "description": "Consulter mes autres projets sur GitHub.",
      "button": "Consulter GitHub",
      "link": "https://github.com/cakegod"
    }
  }
}
